{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "SimpleRNN", "config": {"U_regularizer": null, "input_length": null, "name": "simplernn_1", "go_backwards": false, "output_dim": 64, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "batch_input_shape": [null, 20, 256]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "simplernn_2", "go_backwards": false, "output_dim": 32, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 64, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 32, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 7}}]}